## [debugtest](https://daniellem97.app.spacelift.io/stack/debugtest/run/01JWHM4P8HS3CGAGGXRQCNBJND) plan logs

<details>
<summary>Click here to expand</summary>

```
[01JV7FBMZS94V7V7JD7G28V27B] Planning changes with 0 custom hooks...
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c spacelift-worker env >> /mnt/workspace/.env_hooks_before && tofu plan -input=false -lock=false -out=spacelift.plan && spacelift-worker env >> /mnt/workspace/.env_hooks_after]
data.terraform_remote_state.demo-stack-state: Reading...
data.terraform_remote_state.demo-stack-state: Read complete after 0s
data.aws_kms_alias.aws_rds_default: Reading...
aws_vpc.mtc_vpc: Refreshing state... [id=vpc-0c3261a70311f6cae]
data.aws_ami.server_ami: Reading...
data.aws_ami.server_ami: Read complete after 0s [id=ami-09563a10670fc573c]
data.aws_kms_alias.aws_rds_default: Read complete after 0s [id=arn:aws:kms:*****:872025319814:alias/aws/rds]
aws_security_group.mtc_sg: Refreshing state... [id=sg-082069860a02ef64a]
aws_internet_gateway.mtc_internet_gateway: Refreshing state... [id=igw-03131412a64293059]
aws_subnet.mtc_public_subnet: Refreshing state... [id=subnet-05a55ca6b47ed5494]
aws_route_table.mtc_public_rt: Refreshing state... [id=rtb-0efdeb51db503c285]
aws_route.default_route: Refreshing state... [id=r-rtb-0efdeb51db503c2851080289494]
aws_route.default_route2: Refreshing state... [id=r-rtb-0efdeb51db503c2851080289494]
aws_route_table_association.mtc_public_assoc: Refreshing state... [id=rtbassoc-087dc9abf587278d1]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # aws_db_instance.bad_default_key will be created
  + resource "aws_db_instance" "bad_default_key" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = *****
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = *****
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = *****
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "15.5"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "spacelift-teamalpha-defaultkeydb"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = "arn:aws:kms:*****:872025319814:key/d8c397ad-246e-40bd-8ac3-8a96aaf47cfd"
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = *****
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = *****
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "adminuser"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_instance.bad_no_encryption will be created
  + resource "aws_db_instance" "bad_no_encryption" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = *****
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = *****
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = *****
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "15.5"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "spacelift-teamalpha-noencdb"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = *****
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = false
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "adminuser"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_instance.bad_public will be created
  + resource "aws_db_instance" "bad_public" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = *****
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = *****
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = *****
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "15.5"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "spacelift-teamalpha-publicdb"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = *****
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = *****
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = *****
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "adminuser"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_instance.good_db will be created
  + resource "aws_db_instance" "good_db" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = *****
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = *****
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = *****
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "15.5"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "spacelift-teamalpha-gooddb"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = *****
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = *****
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "adminuser"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_kms_key.cmk will be created
  + resource "aws_kms_key" "cmk" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "CMK for RDS encryption policy test"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = *****
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

[01JV7FBMZS94V7V7JD7G28V27B] Changes are GO
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c tofu show -json]
[01JV7FBMZS94V7V7JD7G28V27B] Uploading the list of managed resources...
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c tofu show -json "spacelift.plan"]
[01JV7FBMZS94V7V7JD7G28V27B] Generating Infracost JSON report from plan
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c INFRACOST_SKIP_UPDATE_CHECK=true infracost breakdown --path /tmp/spacelift-plan3597769214 --format=json --log-level=warn]

[01JV7FBMZS94V7V7JD7G28V27B] Infracost report generated successfully
[01JV7FBMZS94V7V7JD7G28V27B] Mapping Infracost data to resources
[01JV7FBMZS94V7V7JD7G28V27B] Costs mapped successfully
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c tofu output -json]
[01JV7FBMZS94V7V7JD7G28V27B] Please be aware that the run changes calculation includes output changes.
[01JV7FBMZS94V7V7JD7G28V27B] Resource list upload is GO
[01JV7FBMZS94V7V7JD7G28V27B] Generating JSON representation of the plan...
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c tofu show -json "spacelift.plan"]
[01JV7FBMZS94V7V7JD7G28V27B] JSON representation is GO
[01JV7FBMZS94V7V7JD7G28V27B] Generating Infracost JSON report from plan
[01JV7FBMZS94V7V7JD7G28V27B] Running command: sh [-c INFRACOST_SKIP_UPDATE_CHECK=true infracost breakdown --path spacelift.plan.json --format=json --log-level=warn]

[01JV7FBMZS94V7V7JD7G28V27B] Infracost report generated successfully
[01JV7FBMZS94V7V7JD7G28V27B] Loading custom plan policy inputs...
[01JV7FBMZS94V7V7JD7G28V27B] 0 custom plan policy inputs found
[01JV7FBMZS94V7V7JD7G28V27B] Evaluated 2 plan policies
[01JV7FBMZS94V7V7JD7G28V27B] Denied by policy: RDS instance spacelift-teamalpha-noencdb must enable storage_encrypted = true.
[01JV7FBMZS94V7V7JD7G28V27B] Denied by policy: RDS instance spacelift-teamalpha-publicdb must not be publicly_accessible.
[01JV7FBMZS94V7V7JD7G28V27B] Failing the run as per plan policy
```

</details>